// اسپرت سینتکس
// برای تجزیه و تیکه تیکه کردن آرایه و آبجکت ها برای دسترسی به آیتم های آن استفاده میشود
let num = [1,2,3,4,5,6,7,8,9];
let num_2 = [10,20,30,40,50,60,70,80,90];

console.log(...num)// 1 2 3 4 5 6 7 8 9


//برای به هم چسپاندن چند آرایه به هم
console.log(...num,...num_2)

//  اگر میخواهید برای ورودی یک فانکشن از یک آرایه استفاده کنید
let plus = (n,n2,n3) => console.log(n+n2+n3)
plus(...num_2)//60
plus(...[1,4,50])//55

// از اسپرت سینتکس برای نمونه گیری از آرایه و آبجکت ها میتوان استفاده کرد
let user = {
    id:1,
    name:'mohammad',
    age:18
}
let nums = [1,2,3,4,5]


let nums_2 = [...nums]
let user_2 = {...user}

user_2.age = 13
nums_2[1] = 4
//اگر از این روش استفاده نشود با هر تغیر از نمونه آبجکت اصلی هم تغیر میکند اما با این روش هر نمونه مستقل میباشد
console.log(user_2) // age = 13
console.log(user) // age = 18
console.log(nums) // 1,2,3,4,5
console.log(nums_2) // 1,4,3,4,5


