// API
// دو ورودی میگیرد
// اول آدرس - دومی کانفیگ ها
/*
GET = گرفتن داده
POST = ارسال داده
PUT = آپدیت داده
DELETE = حذف داده
*/
fetch('www.google.com',{
    method:'POST', // تعین نوع ارتباط
    headers:{
        "content-type":"application/json" // نوع فرمت داده
    },
    body: JSON.stringify([{"name":"mohammad"}]) // ارسال داده با فرمت خواسته شده 
})

/*
برای get ورودی دوم لازم نیست
برای delete فقط متد را مینویسیم
برای put همث post میباشد با این تفاوت که باید ساختار فرم ارسالی با ان دیتایی که میخواهید آپدیت کنید یکی باشد
*/